## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-target.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,5 +1,60 @@
 
-No changes. Your infrastructure matches the configuration.
+Terraform used the selected providers to generate the following execution
+plan. Resource actions are indicated with the following symbols:
+  + create
 
-Terraform has compared your real infrastructure against your configuration
-and found no differences, so no changes are needed.
+Terraform will perform the following actions:
+
+  # module.log_analytics.azurerm_log_analytics_workspace.main[0] will be created
+  + resource "azurerm_log_analytics_workspace" "main" {
+      + allow_resource_only_permissions = true
+      + daily_quota_gb                  = -1
+      + id                              = (known after apply)
+      + internet_ingestion_enabled      = true
+      + internet_query_enabled          = true
+      + local_authentication_disabled   = false
+      + location                        = "centralus"
+      + name                            = "law-core-dev-cus"
+      + primary_shared_key              = (sensitive value)
+      + resource_group_name             = "rg-core-dev-cus"
+      + retention_in_days               = (known after apply)
+      + secondary_shared_key            = (sensitive value)
+      + sku                             = "PerGB2018"
+      + tags                            = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core-dev-cus"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-log-analytics"
+        }
+      + workspace_id                    = (known after apply)
+    }
+
+  # module.resource_group.azurerm_resource_group.default[0] will be created
+  + resource "azurerm_resource_group" "default" {
+      + id       = (known after apply)
+      + location = "centralus"
+      + name     = "rg-core-dev-cus"
+      + tags     = {
+          + "Business_unit"   = "corp"
+          + "Deployment_mode" = "terraform"
+          + "Environment"     = "dev"
+          + "Managedby"       = "terraform-az-modules"
+          + "Name"            = "core-dev-cus"
+          + "Repository"      = "https://github.com/terraform-az-modules/terraform-azure-resource-group"
+        }
+
+      + timeouts {
+          + create = "90m"
+          + delete = "90m"
+          + read   = "5m"
+          + update = "90m"
+        }
+    }
+
+Plan: 2 to add, 0 to change, 0 to destroy.
+
+Changes to Outputs:
+  + workspace_customer_id = (known after apply)
+  + workspace_id          = (known after apply)

```

</details>

[GitHub Actions](https://github.com/terraform-az-modules/terraform-azure-log-analytics/actions/runs/15591800555)

<!-- diff-action -->
<!-- diff-action/Terraform plan Difference/terraform-plan-diff -->